# Data Cleaning and Preparation

In [ ]:
数据清洗 准备

In [1]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [2]:
import numpy as np
import pandas as pd
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

## Handling Missing Data

In [ ]:
处理丢失数据

In [4]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data
string_data.isnull()

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

过滤丢失数据

In [6]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()#丢弃nan

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data.notnull()
data[data.notnull()]#过滤null数据

0     True
1    False
2     True
3    False
4     True
dtype: bool

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data
cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

     0    1    2
0  1.0  6.5  3.0

In [10]:
data.dropna(how='all')# 传入这个参数后将只丢弃全为缺失值的那些行

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [12]:
data[4] = NA
data
data.dropna(axis=1, how='all')#按轴去掉全nan的

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA##iloc提取数据
df.iloc[:2, 2] = NA
df
df.dropna()
df.dropna(thresh=2)#这一行除去NA值，剩余数值的数量大于等于n，便显示这一行。 还是不理解

          0         1         2
0 -0.289436       NaN       NaN
1  0.838775       NaN       NaN
2  0.910983       NaN -1.413416
3  1.296608       NaN  1.127481
4 -0.568363  0.309362 -0.577385
5 -1.168634 -0.825020 -2.644409
6 -0.152986 -0.751921 -0.132609

          0         1         2
4 -0.568363  0.309362 -0.577385
5 -1.168634 -0.825020 -2.644409
6 -0.152986 -0.751921 -0.132609

          0         1         2
2  0.910983       NaN -1.413416
3  1.296608       NaN  1.127481
4 -0.568363  0.309362 -0.577385
5 -1.168634 -0.825020 -2.644409
6 -0.152986 -0.751921 -0.132609

### Filling In Missing Data

In [23]:
df.fillna(0)##填充0

          0         1         2
0 -0.289436  0.000000  0.000000
1  0.838775  0.000000  0.000000
2  0.910983  0.000000 -1.413416
3  1.296608  0.000000  1.127481
4 -0.568363  0.309362 -0.577385
5 -1.168634 -0.825020 -2.644409
6 -0.152986 -0.751921 -0.132609

In [25]:
df.fillna({1: 0.5, 2: 0})#nan插入特定的值

          0         1         2
0 -0.289436  0.500000  0.000000
1  0.838775  0.500000  0.000000
2  0.910983  0.500000 -1.413416
3  1.296608  0.500000  1.127481
4 -0.568363  0.309362 -0.577385
5 -1.168634 -0.825020 -2.644409
6 -0.152986 -0.751921 -0.132609

In [29]:
_ = df.fillna(0, inplace=True)#如果要改变源数据的话需要添加参数inplace = True才可以改变源数据（也可以用赋值的方式）
df

          0         1         2
0 -0.289436  0.000000  0.000000
1  0.838775  0.000000  0.000000
2  0.910983  0.000000 -1.413416
3  1.296608  0.000000  1.127481
4 -0.568363  0.309362 -0.577385
5 -1.168634 -0.825020 -2.644409
6 -0.152986 -0.751921 -0.132609

In [31]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df
df.fillna(method='ffill')##向下填充
df.fillna(method='ffill', limit=2)##向下填充2个

          0         1         2
0 -0.350109  0.217957 -0.894813
1 -1.741494 -1.052256  1.436603
2 -0.576207       NaN -1.062330
3  0.237372       NaN  0.065253
4 -1.367524       NaN       NaN
5 -0.642437       NaN       NaN

          0         1         2
0 -0.350109  0.217957 -0.894813
1 -1.741494 -1.052256  1.436603
2 -0.576207 -1.052256 -1.062330
3  0.237372 -1.052256  0.065253
4 -1.367524 -1.052256  0.065253
5 -0.642437 -1.052256  0.065253

          0         1         2
0 -0.350109  0.217957 -0.894813
1 -1.741494 -1.052256  1.436603
2 -0.576207 -1.052256 -1.062330
3  0.237372 -1.052256  0.065253
4 -1.367524       NaN  0.065253
5 -0.642437       NaN  0.065253

In [32]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())#important

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Data Transformation

### Removing Duplicates

In [33]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [34]:
data.duplicated()##是否有重复行

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [35]:
data.drop_duplicates()#去掉重复行

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [36]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [37]:
data.drop_duplicates(['k1', 'k2'], keep='last')#last表示留下重复数据的最后一条，，没了5

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [38]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [40]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}#字典

In [41]:
lowercased = data['food'].str.lower()
lowercased
data['animal'] = lowercased.map(meat_to_animal)##重点
data

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [42]:
data['food'].map(lambda x: meat_to_animal[x.lower()])#注意

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [43]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [44]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [45]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [46]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [41]:
data.replace({-999: np.nan, -1000: 0})#字典式替换

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [47]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [48]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [49]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [50]:
data.rename(index=str.title, columns=str.upper)#注意

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [51]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})##重点更换

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [52]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning

In [53]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [54]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)#分段
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [55]:
cats.codes
cats.categories
pd.value_counts(cats)#重点

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [56]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [57]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [58]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.041, 0.27], (0.74, 0.98], (0.27, 0.51], (0.74, 0.98], (0.74, 0.98], ..., (0.51, 0.74], (0.041, 0.27], (0.27, 0.51], (0.51, 0.74], (0.041, 0.27]]
Length: 20
Categories (4, interval[float64]): [(0.041, 0.27] < (0.27, 0.51] < (0.51, 0.74] < (0.74, 0.98]]

In [59]:
data = np.random.randn(1000)  # Normally distributed
cats = pd.qcut(data, 4)  # Cut into quartiles
cats
pd.value_counts(cats)

[(-3.4, -0.657], (0.571, 3.928], (-0.657, -0.0348], (0.571, 3.928], (-3.4, -0.657], ..., (0.571, 3.928], (-0.0348, 0.571], (0.571, 3.928], (-0.0348, 0.571], (-0.0348, 0.571]]
Length: 1000
Categories (4, interval[float64]): [(-3.4, -0.657] < (-0.657, -0.0348] < (-0.0348, 0.571] < (0.571, 3.928]]

(0.571, 3.928]       250
(-0.0348, 0.571]     250
(-0.657, -0.0348]    250
(-3.4, -0.657]       250
dtype: int64

In [60]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.187, -0.0348], (-0.0348, 1.254], (-1.187, -0.0348], (1.254, 3.928], (-1.187, -0.0348], ..., (1.254, 3.928], (-0.0348, 1.254], (-0.0348, 1.254], (-0.0348, 1.254], (-0.0348, 1.254]]
Length: 1000
Categories (4, interval[float64]): [(-3.4, -1.187] < (-1.187, -0.0348] < (-0.0348, 1.254] < (1.254, 3.928]]

### Detecting and Filtering Outliers

In [66]:
data = pd.DataFrame(np.random.randn(1000, 4))
data
data.describe()#重点

            0         1         2         3
0   -0.277327  1.448399  0.841621 -2.901831
1   -1.102564 -0.308803  0.171391  0.395972
2    0.009392  0.231048  0.746418 -0.995042
3   -0.820640  1.772276  0.461102 -0.474685
4   -0.126357 -0.138345  0.487066  0.312131
..        ...       ...       ...       ...
995  2.168296  0.543359  1.074665 -0.375567
996 -0.398509  0.190089  0.940814  1.246253
997 -1.213320 -0.884409  0.720835  0.876968
998  0.014341 -0.673187  0.063475  1.510176
999  0.823474  0.348333  0.785762 -1.268364

[1000 rows x 4 columns]

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.059435    -0.013617     0.017790    -0.046889
std       0.993064     1.027561     1.004854     0.978684
min      -3.108915    -3.183867    -3.481593    -3.194414
25%      -0.753160    -0.734531    -0.656791    -0.752602
50%      -0.043836    -0.000131     0.062355    -0.046439
75%       0.600592     0.683364     0.727425     0.622739
max       2.916153     3.189940     2.961194     3.023720

In [73]:
col = data[2]
col
col[np.abs(col) > 2]

0      0.841621
1      0.171391
2      0.746418
3      0.461102
4      0.487066
         ...
995    1.074665
996    0.940814
997    0.720835
998    0.063475
999    0.785762
Name: 2, Length: 1000, dtype: float64

7      2.146716
48    -2.045650
66     2.903300
78     2.269592
97     2.135719
         ...
873   -2.451487
877   -3.170292
881   -2.839491
894    2.279154
939   -2.565816
Name: 2, Length: 43, dtype: float64

In [76]:
np.abs(data) > 1#注意
data[(np.abs(data) > 3).any(1)]#注意

         0      1      2      3
0    False   True  False   True
1     True  False  False  False
2    False  False  False  False
3    False   True  False  False
4    False  False  False  False
..     ...    ...    ...    ...
995   True  False   True  False
996  False  False  False   True
997   True  False  False  False
998  False  False  False   True
999  False  False  False   True

[1000 rows x 4 columns]

            0         1         2         3
56  -1.116332 -3.018842 -0.298748  0.406954
81  -3.108915  1.117755 -0.152780 -0.340173
211  1.188742 -3.183867  1.050471 -1.042736
258 -2.214074 -3.140963 -1.509976 -0.389818
423 -0.088202  1.090038 -0.848098 -3.194414
453  0.474358  0.003349 -0.011807  3.023720
482  2.368010  0.452649 -3.481593  0.789944
651  0.164293  3.082067 -0.516982  0.251909
679 -0.843849  3.189940  0.070978  0.516982
843  0.623798 -0.436479  0.901529 -3.044612
877  0.617561 -1.148738 -3.170292 -1.017073

In [78]:
data[np.abs(data) > 3] = np.sign(data) * 3#sign函数
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.059326    -0.013545     0.018442    -0.046674
std       0.992735     1.025714     1.002761     0.977867
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.753160    -0.734531    -0.656791    -0.752602
50%      -0.043836    -0.000131     0.062355    -0.046439
75%       0.600592     0.683364     0.727425     0.622739
max       2.916153     3.000000     2.961194     3.000000

In [79]:
np.sign(data).head()#取数据正负

     0    1    2    3
0 -1.0  1.0  1.0 -1.0
1 -1.0 -1.0  1.0  1.0
2  1.0  1.0  1.0 -1.0
3 -1.0  1.0  1.0 -1.0
4 -1.0 -1.0  1.0  1.0

### Permutation and Random Sampling

In [80]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5)#即随机排列序列
sampler

array([2, 1, 4, 0, 3])

In [82]:
df
df.take(sampler)#记住 按这个序列

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

    0   1   2   3
2   8   9  10  11
1   4   5   6   7
4  16  17  18  19
0   0   1   2   3
3  12  13  14  15

In [83]:
df.sample(n=3) #碎金抓取3个样本

    0   1   2   3
4  16  17  18  19
0   0   1   2   3
3  12  13  14  15

In [86]:
choices = pd.Series([5, 7, -1, 6, 4])
choices
draws = choices.sample(n=10, replace=True)#有点无聊这个
draws

0    5
1    7
2   -1
3    6
4    4
dtype: int64

2   -1
3    6
1    7
2   -1
1    7
1    7
3    6
4    4
0    5
4    4
dtype: int64

### Computing Indicator/Dummy Variables

In [88]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
df
pd.get_dummies(df['key'])#利用pandas实现one hot encode的方式

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [90]:
dummies = pd.get_dummies(df['key'], prefix='key')#前缀
dummies
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [91]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames)
movies[:10]

C:\ProgramData\Anaconda3\lib\site-packages\pandas\io\parsers.py:765: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  return read_csv(**locals())

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [93]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [94]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [95]:
zero_matrix = np.zeros((len(movies), len(genres)))
zero_matrix
dummies = pd.DataFrame(zero_matrix, columns=genres)

array([[0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       ...,
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.]])

In [99]:
gen = movies.genres[0]
gen
gen.split('|')

dummies.columns.get_indexer(gen.split('|'))

"Animation|Children's|Comedy"

['Animation', "Children's", 'Comedy']

array([0, 1, 2], dtype=int64)

In [100]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [102]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic
movies_windic.iloc[0]

,movie_id,title,genres,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Adventure,Genre_Fantasy,Genre_Romance,Genre_Drama,...,Genre_Crime,Genre_Thriller,Genre_Horror,Genre_Sci-Fi,Genre_Documentary,Genre_War,Genre_Musical,Genre_Mystery,Genre_Film-Noir,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,1.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,1.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),Comedy|Drama,0.0,0.0,1.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,3948,Meet the Parents (2000),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,3949,Requiem for a Dream (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,3950,Tigerland (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,3951,Two Family House (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,3952,"Contender, The (2000)",Drama|Thriller,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

movie_id                                      1
title                          Toy Story (1995)
genres              Animation|Children's|Comedy
Genre_Animation                               1
Genre_Children's                              1
                               ...
Genre_War                                     0
Genre_Musical                                 0
Genre_Mystery                                 0
Genre_Film-Noir                               0
Genre_Western                                 0
Name: 0, Length: 21, dtype: object

In [103]:
np.random.seed(12345)
values = np.random.rand(10)
values
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

array([0.9296, 0.3164, 0.1839, 0.2046, 0.5677, 0.5955, 0.9645, 0.6532,
       0.7489, 0.6536])

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## String Manipulation

### String Object Methods

In [104]:
val = 'a,b,  guido'
val.split(',')#记住

['a', 'b', '  guido']

In [105]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [106]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [107]:
'::'.join(pieces)#记住

'a::b::guido'

In [108]:
'guido' in val
val.index(',')
val.find(':')

True

1

-1

In [109]:
val.index(':')

ValueError: substring not found

In [110]:
val.count(',')

2

In [111]:
val.replace(',', '::')
val.replace(',', '')

'a::b::  guido'

'ab  guido'

### Regular Expressions

In [112]:
import re
text = "foo    bar\t baz  \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [113]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [114]:
regex.findall(text)

['    ', '\t ', '  \t']

In [115]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [116]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [117]:
m = regex.search(text)
m
text[m.start():m.end()]

'dave@google.com'

In [118]:
print(regex.match(text))

None

In [119]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [120]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [121]:
m = regex.match('wesm@bright.net')
m.groups()#注意

('wesm', 'bright', 'net')

In [123]:
regex.findall(text)#注意

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [124]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

### Vectorized String Functions in pandas

In [125]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data
data.isnull()

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [126]:
data.str.contains('gmail')#注意

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [128]:
pattern
data.str.findall(pattern, flags=re.IGNORECASE)#注意

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [129]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [130]:
matches.str.get(1)
matches.str[0]

AttributeError: Can only use .str accessor with string values!

In [131]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [132]:
pd.options.display.max_rows = PREVIOUS_MAX_ROWS

## Conclusion